[
  {
    "genre":["Adult"],
    "cover":"way-of-kings.jpg",
    "title":"Way of Kings",
    "author":"Brandon Sanderson",
    "series":"The Stormlight Archive",
    "order":1,
    "tags":["Fantasy","Adventure","Mystery"],
    "pace":"medium-paced",
    "description":"<p><em>I long for the days before the Last Desolation.</em></p><p><em>The age before the Heralds abandoned us and the Knights Radiant turned against us. A time when there was still magic in the world and honor in the hearts of men.</em></p><p><em>The world became ours, and we lost it. Nothing, it appears, is more challenging to the souls of men than victory itself.</em></p><p><em>Or was that victory an illusion all along? Did our enemies realize that the harder they fought, the stronger we resisted? Perhaps they saw that the heat and the hammer only make for a better grade of sword. But ignore the steel long enough, and it will eventually rust away.</em></p><p><em>There are four whom we watch. The first is the surgeon, forced to put aside healing to become a soldier in the most brutal war of our time. The second is the assassin, a murderer who weeps as he kills. The third is the liar, a young woman who wears a scholar’s mantle over the heart of a thief. The last is the highprince, a warlord whose eyes have opened to the past as his thirst for battle wanes.</em></p><p><em>The world can change. Surgebinding and Shardwielding can return; the magics of ancient days can become ours again. These four people are key.</em></p><p><em>One of them may redeem us.</em></p><p><em>And one of them will destroy us.</em></p><p>Widely acclaimed for his work completing Robert Jordan's <em>Wheel of Time</em> saga, Brandon Sanderson now begins a grand cycle of his own, one every bit as ambitious and immersive.</p><p>Roshar is a world of stone and storms. Uncanny tempests of incredible power sweep across the rocky terrain so frequently that they have shaped ecology and civilization alike. Animals hide in shells, trees pull in branches, and grass retracts into the soilless ground. Cities are built only where the topography offers shelter.</p><p>It has been centuries since the fall of the ten consecrated orders known as the Knights Radiant, but their Shardblades and Shardplate remain: mystical swords and suits of armor that transform ordinary men into near-invincible warriors. Men trade kingdoms for Shardblades. Wars are fought for them, and won by them.</p><p>One such war rages on a ruined landscape called the Shattered Plains. There, Kaladin, who traded his medical apprenticeship for a spear, has been reduced to slavery. In a war that makes no sense, where ten armies fight separately against a single foe, he struggles to save his men and to fathom the leaders who consider them expendable.</p><p>Brightlord Dalinar Kholin commands one of those other armies. Like his brother, the late king, he is fascinated by an ancient text called The Way of Kings. Troubled by overpowering visions of ancient times and the Knights Radiant, he has begun to doubt his own sanity.</p><p>Across the ocean, an untried young woman named Shallan seeks to train under the eminent scholar and notorious heretic Jasnah Kholin, Dalinar's niece. Though she genuinely loves learning, Shallan's motives are less than pure. As she plans a daring theft, her research for Jasnah hints at secrets of the Knights Radiant and the true cause of the war.</p><p>The result of more than ten years of planning, writing, and worldbuilding, <em>The Way of Kings</em> is but the opening movement of the <em>Stormlight Archive,</em> a bold masterpiece in the making.</p><p>Speak again the ancient oaths,<blockquote>LIFE BEFORE DEATH.<br />STRENGTH BEFORE WEAKNESS.<br />JOURNEY BEFORE DESTINATION.</blockquote>and return to men the Shards they once bore.</p><p>The Knights Radiant must stand again.</p>"
  },
  {
    "genre":["Adult"],
    "cover":"words-of-radiance.jpg",
    "title":"Words of Radiance",
    "author":"Brandon Sanderson",
    "series":"The Stormlight Archive",
    "order":2,
    "tags":["Fantasy", "Adventure", "Mystery"],
    "pace":"medium-paced",
    "description":"<p><em>The Knights Radiant must stand again.</em></p><p><em>The ancient oaths have at last been spoken; the spren return. Men seek that which was lost. I fear the struggle will destroy them.</em></p><p><em>It is the nature of the magic. A broken soul has cracks into which something else can be fit.  Surgebindings, the powers of creation themselves.  They can brace a broken soul; but they can also widen its fissures.</em></p><p><em><strong>The Windrunner,</strong> lost in a shattered land, balanced upon the boundary between  vengeance and honor. <strong>The Lightweaver,</strong> slowly being consumed by her past, searching for the lie that she must become. <strong>The Bondsmith,</strong> born in blood and death, striving to rebuild what was destroyed. <strong>The Explorer,</strong> straddling the fates of two peoples, forced to  choose between slow death and a terrible betrayal of all she believes.</em></p><p><em>It is past time for them to awaken, for the Everstorm looms.</em></p><p><em>And <strong>the Assassin</strong> has arrived.</em></p><p>The eagerly awaited sequel to the <em>New York Times</em> bestselling <em>The Way of Kings.</em></p><p>Six years ago, the Assassin in White, a hireling of the inscrutable Parshendi, assassinated the Alethi king on the very night a treaty between men and Parshendi was being celebrated. So began the Vengeance Pact among the highprinces of Alethkar and the War of Reckoning against the Parshendi.</p><p>Now the Assassin is active again, murdering rulers all over the world, using his baffling powers to thwart every bodyguard and elude all pursuers. Among his prime targets is Highprince Dalinar, widely considered the power behind the Alethi throne. His leading role in the war would seem reason enough, but the Assassin's master has much deeper motives.</p><p>Expected by his enemies to die the miserable death of a military slave, Kaladin survived to be given command of the royal bodyguards, a controversial first for a low-status darkeyes.  Now he must protect the king and Dalinar from every common peril as well as the distinctly uncommon threat of the Assassin, all while secretly struggling to master remarkable new powers that are somehow linked to his honorspren, Syl.</p><p>Brilliant but troubled Shallan strives along a parallel path. Despite being broken in ways she refuses to acknowledge, she bears a terrible burden: to somehow prevent the return of the legendary Voidbringers and their civilization-ending Desolation. The secrets she needs can be found at the Shattered Plains, but even arriving there proves more difficult than she imagined.</p><p>Meanwhile, at the heart of the Shattered Plains, the Parshendi are making an epochal decision. Hard pressed by years of Alethi attacks, their numbers ever shrinking, they are convinced by their war leader, Eshonai, to risk everything on a desperate gamble with the very supernatural forces they once fled. The consequences for Parshendi and humans alike—indeed, for Roshar itself—are as dangerous as they are incalculable.</p>"
  },
  {
    "genre":["Adult"],
    "title":"Rythym of War",
    "author":"Brandon Sanderson",
    "series":"The Stormlight Archive",
    "order":4,
    "tags":["Fantasy","Adventure","Mystery"],
    "pace":"medium-paced",
    "description":"<p><strong>The Stormlight Archive saga continues in <em>Rhythm of War,</em> the eagerly awaited sequel to Brandon Sanderson's #1 <em>New York Times</em> bestselling <em>Oathbringer,</em> from an epic fantasy writer at the top of his game.</strong></p><p>After forming a coalition of human resistance against the enemy invasion, Dalinar Kholin and his Knights Radiant have spent a year fighting a protracted, brutal war. Neither side has gained an advantage.</p><p>Now, as new technological discoveries begin to change the face of the war, the enemy prepares a bold and dangerous operation. The arms race that follows will challenge the very core of the Radiant ideals, and potentially reveal the secrets of the ancient tower that was once the heart of their strength.</p>"
  },
  {
    "genre":["Adult"],
    "cover":"warbreaker.jpg",
    "title":"Warbreaker",
    "author":"Brandon Sanderson",
    "series":"Standalone",
    "tags":["Fantasy","Adventure","Mystery"],
    "pace": "medium-paced",
    "description":"<p>From #1 <em>New York Times</em> bestselling author Brandon Sanderson, <em>Warbreaker</em> is the story of two sisters, who happen to be princesses, the God King one of them has to marry, the lesser god who doesn't like his job, and the immortal who's still trying to undo the mistakes he made hundreds of years ago.</p><p>Their world is one in which those who die in glory return as gods to live confined to a pantheon in Hallandren's capital city and where a power known as BioChromatic magic is based on an essence known as breath that can only be collected one unit at a time from individual people.</p><p>By using breath and drawing upon the color in everyday objects, all manner of miracles and mischief can be accomplished. It will take considerable quantities of each to resolve all the challenges facing Vivenna and Siri, princesses of Idris; Susebron the God King; Lightsong, reluctant god of bravery, and mysterious Vasher, the Warbreaker.</p>"
  }
]