[
  {
    "cover":"volume-one.jpeg",
    "title":"Wilde Creek Volume One",
    "author":"R.E. Butler",
    "series":"Wilde Creek",
    "order":1,
    "tags":["fantasy","paranormal","romance"],
    "pace":"fast-paced",
    "description":"<p class='text-center'>Mate of Her Heart (Wilde Creek One)</p><p>Werewolf Eveny Moore is coming into her first heat at the age of twenty-five. Bucking tradition, she chooses to go through her first heat alone instead of choosing an unmated male from her pack. There is only one male that she wants in her bed and her life: her best friend, Luke Elrich. But Luke is human and doesn't understand the consequences of her heat-cycle, so she hides out in a safehouse, planning to ride out the cycle alone and then ask Luke to be her mate.</p><p>Luke has loved Eveny forever, but something is going on between them. He's afraid he's losing her forever, until she promises to talk to him after her heat-cycle is over. He overhears her brother, the pack alpha, ask another wolf to go to Eveny and take her through the heat-cycle. What her brother doesn't know is that the male plans to invite some of his friends along. And Eveny is alone in a remote cabin, unprotected. Luke will do anything to keep her safe, even if it means going up against four wolves.</p><p class='text-center'>* * * * *</p><p class='text-center'>The Alpha's Heart (Wilde Creek Two)</p><p>Alpha wolf Acksel wakes up one morning in the bed of a woman he's had a crush on since high school. Brynn Mara was the one human who had been friendly to him in school and now, ten years later, she is snuggled up at his side, smelling like passion and sweet dreams. Even though Acksel has declared that his pack members can mate with humans from now on, he knows that any woman he takes as his mate will have a target on her back. Especially if she's a fragile human. Deciding it's better to cut things off than string her along when there is no hope for a relationship, he leaves without a word and ignores her.</p><p>But it doesn't matter if Acksel acknowledges her or not, because their one night of passion has left a permanent reminder of what happens when one drunk wolf forgets protection. Angry, banished wolves from his pack discover Brynn's secret and decide to use her against Acksel. His worst fears have come true and the only woman that ever touched his heart is now suffering because of his mistake. Can he save her in time?</p><p>This book contains one pissed-off, emotionally damaged alpha, the human woman who can tame him, and a sweet little surprise that no one expected.</p>",
    "publisher":"Smashwords",
    "date":"July 17, 2018",
    "words":93120,
    "isbn":9780463275597
  },
  {
    "cover":"volume-two.jpeg",
    "title":"Wilde Creek Volume Two",
    "author":"R.E. Butler",
    "series":"Wilde Creek",
    "order":2,
    "tags":["fantasy","paranormal","romance"],
    "pace":"fast-paced",
    "description":"<p class='text-center'>The Protector's Heart (Wilde Creek Book Three)</p><p>Nila Patterson doesn't want anything to do with wolves. Her werewolf ex-husband continues to stalk her and their son, terrifying her to no end. The last thing she wants to do is acknowledge her attraction to the very sexy Malachi Slattery, who has been watching her for weeks. He's not as discreet as he thinks he's being. She's not about to forget that Malachi is a wolf, and she's learned the hard way that wolves are not to be trusted.</p><p>All Malachi Slattery wants to do is take care of Nila and her son. Nila is his mate, and his wolf has been howling to protect her ever since they met. But she doesn't like wolves, and he can't figure out a way to get her to see that he's nothing like her ex. He'll have to use every trick in the book in order to get past her defenses and prove to her that he's a male she can count on. When her ex does the unthinkable in a ploy to get her back into his arms, Malachi will show him why no one messes with a Protector's mate.</p><p>This book contains one stubborn woman, one determined wolf, a sweet little boy, sprinkled liberally with a dose of crazy ex, stalking, kidnapping, and excessive use of the word ‘mine'. Contains m/f interaction.</p><p class='text-center'>* * * * *</p><p class='text-center'>The Omega's Heart (Wilde Creek Book Four)</p><p>Jeremiah Kincaid has spent most of his life on the outside looking in. Unable to shift even though he's a full-blooded wolf, he's forced to be an omega in his pack, looked down upon by his fellow pack members. No male wants him at his back in a fight, no female wants him in her bed. As his twenty-eighth birthday approaches, he finds himself reaching the limit of what he can tolerate, and makes plans to leave the pack and try to blend in with the humans.</p><p>Honey Williams' alpha father has been acting strangely ever since she turned twenty-five, and as the January full moon draws near, she begins to feel like something is going to happen to her. Something bad. She takes the opportunity of her college friend's bachelorette party to leave town, but instead of heading to her friend's house, she runs in the opposite direction. As the full moon looms near, she knows she needs to find a place to stay so she can shift and hunt before she moves on in her attempt to get away from whatever plans her father is making for her. When she arrives in Wilde Creek two days before the full moon, she sees a small town with lots of woods to hunt in and knows she's found a temporary place to stay. To ensure her father can't order her home for the full moon, she disables her car, getting help from a friendly she-wolf and a handsome tow-truck driver.</p><p>When Jeremiah fakes illness to avoid the full moon preparations, he never expected to be sitting on his back porch the night of the full moon and have his life change forever. One look at the sultry beauty who shifts in his yard and he knows he's in the presence of his mate. Honey's father demands she return home, and the truth of his betrayal is revealed. Jeremiah is determined to keep Honey safe and keep her forever. He might not be able to shift, but he'll be damned if he lets Honey's life be ruined.</p><p>When a non-shifting wolf and a beautiful she-wolf get together, expect scorching sex, ripped clothes, and furniture broken in the heat of passion. Contains m/f interaction.</p>",
    "publisher":"Smashwords",
    "date":"July 18, 2018",
    "words":116300,
    "isbn":9780463927564
  },
  {
    "cover":"volume-three.jpeg",
    "title":"Wilde Creek Volume Three",
    "author":"R.E. Butler",
    "series":"Wilde Creek",
    "order":3,
    "tags":["fantasy","paranormal","romance"],
    "pace":"fast-paced",
    "description":"<p class='text-center'>The Scarred Heart (Wilde Creek Book Five)</p><p>Kammie Townsend has always kept to herself. She doesn't want anyone to see the scars of her childhood, left behind by her abusive uncle. Everything changes for her on the night of the full moon, when she follows a reindeer and gets tackled by a bear shifter. He says they're mates, but even though he's the sexiest male she's ever met, Kammie knows that once he sees the evidence of her painful history he won't want anything to do with her.</p><p>Row Grayson has lived a hard life, fighting in tournaments for the amusement of the kings of neighboring bear sleuths. The only bright spots are his mother and his adopted sister, who is a reindeer shifter. On the way to take Dani to her people, she suddenly takes off and leaves Row behind. As he attempts to catch up to her, he senses his own mate in the snow-covered woods of a town called Wilde Creek. His mate is anything but receptive to his touch. Her skin is as scarred as years of brutal fighting have left his heart, but he knows he can convince her he finds her beautiful inside and out.</p><p>When he takes Kammie back to his people to make her his mate, things go sideways fast – an enemy from Row's past tries to take Kammie from him. To save her, Row has to fight harder than he ever has. When a determined bear tangles with an equally determined she-wolf, things will heat up fast. Expect growling, naked conversations, and a bear who will kill to keep his mate by his side forever.</p><p class='text-center'>* * * * *</p><p class='text-center'>Dancer's Heart (Wilde Creek Book Six)</p><p>Adam Cruz has spent the last twelve years of his life wondering if he'd ever find his truemate. As a low-ranked omega wolf, with a body full of scars from a firebomb, he's had more than his fair share of trauma and shame. All he wants is to find his truemate and settle down, even though he wonders if his mate will care about his scars, or that he can't hunt as well as other wolves because of them.</p><p>As the only reindeer shifter in a bear den, Dancer Grayson knows what it's like not to fit in. When she runs into her truemate in the woods of Wilde Creek, she discovers that she fits right in with him. Adam's not ashamed to have prey as a mate, and she's not ashamed of his scars. Together, she's certain they can survive anything.</p><p>When Adam's gambling-addict dad hits him up for money and Adam refuses, his dad does the unthinkable, and Dani ends up kidnapped. What the kidnappers don't count on is that there isn't just a wolf pack looking for Dani, but her own kind. Can Adam get to her before she's harmed, or will she be lost to him forever?</p>",
    "publisher":"Smashwords",
    "date":"July 18, 2018",
    "words":84590,
    "isbn":9780463488928
  },
  {
    "cover":"hunters-heart.jpeg",
    "title":"The Hunter's Heart",
    "author":"R.E. Butler",
    "series":"Wilde Creek",
    "order":7,
    "tags":["fantasy","paranormal","romance"],
    "pace":"fast-paced",
    "description":"<p>She-wolf Mia Slattery has loved Lucian since she was a little girl, but her brother's human best friend has always been forbidden fruit. Deciding that it's better to move on than pine for someone she can never have, she opts to go on vacation with her parents, hoping Mr. Right will happen to be where she's going.</p><p>Lucian has been crazy about Mia for as long as he can remember. As a hunter who specializes in finding law-breaking shifters, his life is as dangerous as it comes, and he would never put Mia in jeopardy.</p><p>When the family of a shifter Lucian put away comes for revenge, Mia is caught in the crossfire, and Lucian will have to turn against his fellow hunters in order to save her life. Saving Mia comes with a price, but Lucian's willing to do anything to protect her — even if it means giving up his future.</p>",
    "publisher":"Smashwords",
    "date":"Aug 6, 2017",
    "words":54270,
    "isbn":9781370913701
  },
  {
    "cover":"betas-heart.jpeg",
    "title":"The Beta's Heart",
    "author":"R.E. Butler",
    "series":"Wilde Creek",
    "order":8,
    "tags":["fantasy","paranormal","romance"],
    "pace":"fast-paced",
    "description":"<p>Ren Corbin has a great life as the alpha's right hand. He's enjoying his life, but he knows it's beyond time to find a mate and settle down. During a spring full moon, he senses someone in the woods and knows it's his truemate. It doesn't matter to him that she's a fae and not a wolf; he only cares that she's gorgeous and she's his.</p><p>Kismet Thorburn, a nature-controlling fae with copper-tipped white wings, can't stop thinking about Wilde Creek or the wolf she dreamed about. When she hides in the woods outside the alphas' home to get a glimpse of the male from her dreams, he senses their connection and finds her.</p><p>Ren and his wolf are both crazy about Kismet. Marking and mating her is as important to him as breathing, and starting their new life together is everything he ever hoped it would be. When a new wolf pack requests a meeting with the Wilde Creek alpha, Ren's surprised to see his ex is the alpha and has him on her mind.</p><p>When his ex makes trouble, Kismet and Ren must fight to stay together. Can their new love last, or will all be lost in the woods of Wilde Creek?</p>",
    "publisher":"Smashwords",
    "date":"Sept. 10, 2018",
    "words":55610,
    "isbn":9780463956144
  },
  {
    "cover":"law-of-the-lycans.jpeg",
    "title":"Law of the Lycans: The Original Trilogy",
    "author":"Nicky Charles",
    "series":"Law of the Lycans",
    "order":0,
    "tags":["fantasy","paranormal","romance"],
    "pace":"medium-paced",
    "description":"<p>Alpha males, passionate love, danger and deceit; find it all in the original Law of the Lycans trilogy, now available together with a bonus NEW novella! In The Mating, meet Kane, a new Alpha, and Elise who had no idea she'd end up mated to a total stranger. The Keeping continues the tale with Kane's rough-edged brother, Ryne. Who would have thought a photograph and a persistent reporter named Melody Green might bring down the noble pack? Then, in The Finding, follow Bryan Cooper, a persistent Lycan who refuses to quit following the trail of the mysterious missing heiress, Cassandra Greyson. Why was her existence kept a secret? Finally, read the long-awaited bonus novella, Kane: I am Alpha. A treat for all die-hard fans of the series, this story gives a glimpse of Kane's thoughts in the weeks leading up to The Mating. How did he really feel about an arranged alliance with Elise's pack?</p>",
    "publisher":"Smashwords",
    "date":"July 31, 2017",
    "words":416030,
    "isbn":9781370175123
  },
  {
    "cover":"claimed-by-the-alien-prince.jpeg",
    "title":"Claimed by the Alien Prince",
    "author":"Nancey Cummings",
    "series":"Alpha Aliens of Fremm",
    "order":1,
    "tags":["fantasy","romance"],
    "description":"<p>Prince Aster didn't believe in \"mates\" or other bedtime stories...until he sensed Evie's curious scent. The curvy human woman with curly brown hair and caramel skin is nothing like he expected -- but someone unique and strange. This alpha alien must claim her and take her in every way.</p><p>Evie can't deny her attraction to the big blue alien 'man', or their chemistry -- but his mate? Can she leave everyone and everything behind for this towering, muscular stranger from another world? His sky blue skin glows where they touch and it excites her in a passionate new way. Does she have a choice -- or is it her destiny?</p><p>This is a short novella in a fated mates serial. No cliffhanger. Guaranteed happy ending.</p>",
    "publisher":"Menura Press",
    "date":"Oct 1, 2016",
    "words":12493
  },
  {
    "cover":"phantom-riders-hawk.jpeg",
    "title":"Phantom Riders MC - Hawk",
    "author":"Tory Richards",
    "series":"The Phantom Riders MC Trilogy",
    "order":1,
    "tags":["romance"],
    "description":"<p>Book 1 in a trilogy. No cliffhangers! Stand alone romance!</p><p>I quickly scooted out of the booth, realizing Hawk was right behind me. Before I could question him, he grabbed my arm and proceeded to jerk me in the direction leading to the back of the bar. I glanced around the bar wildly, but I didn’t see Dane’s men anywhere.</p><p>“They left, but they’ll be back.” We entered a dark hallway and halfway down he stopped us at a door. I expected him to knock, but he lifted his leg and kicked the door in, causing the occupants in the room to scream out in fear. “Out!” he snarled.</p><p>I barely had time to acknowledge the naked couple before they snatched up their strewn about clothes and rushed past us. As the man passed me I recognized him as one of Hawk’s men. We made eye contact long enough for him to wink at me. Once they cleared the threshold, Hawk pulled me inside and slammed the door behind him.</p><p>“Take your clothes off.”</p><p>“What?”</p><p>“Take your clothes off.”</p><p>I know my jaw dropped at his demand. When I realized that he meant it I began to back up, slowly shaking my head. “You’re crazy!” I whispered sharply.</p><p>“Take your fuckin’ clothes off!” So far he hadn’t moved from his spot, yet I’d backed up until my back was against the wall. “Those men knew how to find you, which means there’s a bug on you somewhere.”</p><p>I tried to decipher what he was saying, but my brain wouldn’t wrap around the words that he thought I had a bug on me. He took a menacing step toward me, and that was all I needed to do what he wanted. Strangely, I wasn’t afraid of Hawk, only of what having his hands on me would make me feel. I was attracted to him in a strange way that left me feeling confused. Maybe it was because I knew that he wasn’t attracted to me.</p><p>I quickly removed my hoodie and handed it to him, kicking off my shoes at the same time. As Hawk began going over it, I unzipped and rolled down my jeans. I’d reached for the bottom of my t-shirt when a memory slammed into me.</p><p>“Just a minute.” I waited for him to look at me. “There’s no way there can be a bug in these clothes because they aren’t mine. I took them from a dryer in the laundromat.”</p><p>He hesitated for only a second. “I want everything.”</p><p>Deciding not to argue with him, I removed my t-shirt and threw it at him. He caught it to his chest and I swear I saw the tiniest curve of his mouth showing amusement at my irritation. He examined my clothes thoroughly, finding nothing, as I’d expected. Then he turned those dark eyes on me, running his gaze up and down my body, missing nothing.</p><p>“Everything,” he demanded. “Or did you borrow your underwear, too?”</p>",
    "publisher":"Smashwords",
    "date":"Mar 15, 2016",
    "words":91969
  },
  {
    "cover":"blue-moon.jpeg",
    "title":"Blue Moon",
    "author":"Angela Colsin",
    "series":"The Crucible",
    "order":1,
    "tags":["fantasy","paranormal","romance"],
    "publisher":"Smashwords",
    "date":"Aug 6, 2015",
    "words":101451,
    "description":"<p>When betrayed by his Alpha, Cade Hodgins takes the role in leading the Arkin City pack and begins his search for those responsible for his father’s death. Information is hard to come by however—until a stray lupine wanders into his territory.</p><p>But Ashley Passmore is no ordinary stray. She’s a newborn wolf, turned from being a human with no prior knowledge that lupines existed. Due to her blackouts, she can’t recall who turned her or why, but Cade suspects her attackers may be the same as those who entrapped his father.</p><p>In the meantime, Cade takes Ashley in to help her regain control of her new life, and finds more than just a lead—she’s his mate. But Ashley is adjusting to the new world she’s been thrust into, making it uncertain she’ll accept the growing bond between them, while those who turned her want to make sure she’s silenced for good.</p>"
  },
  {
    "cover":"strange-brew.jpeg",
    "title":"Strange Brew",
    "author":"Angela Colsin",
    "series":"The Crucible",
    "order":3,
    "tags":["fantasy","paranormal","romance"],
    "publisher":"Smashwords",
    "date":"Aug 11, 2015",
    "words":99605,
    "description":"<p>Feeling out of touch with her magical gifts, Aislinn Carmichael is a witch seeking a means of restoring her ability to its fullest potential. Despite the warnings of family and friends, the endeavor inevitably drives her to accept the initiation trial of a witch coven called The Trine.</p><p>Their test demands the capture of a supernatural creature, a task Aislinn has little doubt she can accomplish with relative ease. But of all the potentially benign creatures she could’ve snared, none other than a feral werewolf stumbles into her trap. Making matters worse is The Trine’s intentions for her dangerous captive, forcing Aislinn to release him and potentially risk retaliation.</p><p>But vengeance is the farthest thing from the werewolf’s mind.</p><p>Troy Ashland is a werewolf standing at death’s door, slowly losing his humanity until there’s nothing left but savage instincts. It’s a process all werewolves face, and the only thing that can appease his restless beast is his mate. So when word arrives from an oracle saying to travel to the Southern US to find her, he’s on the next flight out.</p><p>After his arrival in Arkin City, the last thing Troy expects is to be caught in a magical trap. But all is forgiven with one glimpse of his temporary jailor, who turns out to be the very woman he was searching for. Still, the task of winning her is surprisingly difficult. Not only is Aislinn inexplicably resisting their attraction, but The Trine won’t leave well enough alone …</p>"
  },
  {
    "cover":"light-of-dawn.jpeg",
    "title":"Light of Dawn",
    "author":"Angela Colsin",
    "series":"The Crucible",
    "order":2,
    "tags":["fantasy","paranormal","romance"],
    "publisher":"Smashwords",
    "date":"Aug 11, 2015",
    "words":101780,
    "description":"<p>Hired to find a curse box, the draconian mercenary, Ulric Dra’Kai, is directed to seek out the human Charlotte Mulligan who’ll lead him to his ultimate goal. Expecting to get information from her with ease, Ulric instead meets a determined mortal who refuses to be intimidated—and draws him in like no other.</p><p>As that attraction grows, he comes to believe Charlotte may be his destined mate, but there’s a problem—he’s immortal, making that impossible. Answers could possibly lie in the dormant supernatural side of Charlotte’s lineage, but getting them proves difficult when vampires are out for her blood.</p><p>Charlotte thought she was an ordinary human living an average life until receiving an odd package in the mail containing a unique trinket box. Soon after, she’s attacked by vampires and swept up in a hunt by a dangerous but attractive stranger who not only reveals the truth of the supernatural world, but also informs her that she’s a part of it.</p><p>Trying to survive while her life is coming apart, a passion for the draconian protecting her sparks to life, one she has to guard her heart against when being mortal makes a union between them difficult, if not impossible.</p>"
  },
  {
    "cover":"final-calling.jpeg",
    "title":"The Final Calling",
    "author":"Angela Colsin",
    "series":"The Crucible",
    "order":5,
    "tags":["fantasy","paranormal","romance"],
    "publisher":"Smashwords",
    "date":"June 3, 2016",
    "words":99420,
    "description":"<p>Prophecies, tyrants, assassins, and exiled royalty aren't the things Edith Walsh thought she'd be dealing with when her training as a mage apprentice began. Her main focus is becoming an enchantress by completing the Final Calling—a grand scavenger hunt all apprentices undertake to gather items needed to craft their coveted staff and gain eternal life.</p><p>This challenge can prove lethal if care isn't taken to watch one's steps. But making matters worse, Edith has also been marked for death by the Steward of the Perosian Empire, a tyrant named Rothario, all because of a pesky prophecy made centuries before her birth foretelling his demise at her hands.</p><p>So what's a mage to do? Simple; accept the assistance of a sexy Perosian who's dealt with Rothario's minions for as long as he can remember. Yet Isaac wants far more than Edith's safety—she's his mate, and his fiery gaze, wicked tongue, and shameless seductions inflame her more intensely than she's ever known.</p><p>Convicted of murdering the imperial family of Perosia, Isaac's spent centuries as a fugitive hunted by a homeland he doesn't recall. But his ruthless talent for survival serves him well, and there's nothing he won't do to protect Edith from the forces threatening her life, even if it means sacrificing his own.</p>"
  },
  {
    "cover":"tempting-eternity.jpeg",
    "title":"Tempting Eternity",
    "author":"Angela Colsin",
    "series":"The Crucible",
    "order":9,
    "tags":["fantasy","paranormal","romance"],
    "publisher":"Smashwords",
    "date":"April 9, 2019",
    "words":100170,
    "description":"<p>As one of the first vampires created by the original five thousand years ago, time has taken it's toll on Mathias, weathering him until nothing seems like a surprise anymore. But even he isn't prepared for a chance encounter with a fae who proves to have a lover's blood link.</p><p>For a vampire, such a connection is a fevered, hopeless fantasy. None have blood as sweetly enticing as the fae, but they'd never survive the turning, making it imperative to resist Isadora's charms, otherwise put her very life at risk.</p><p>Yet distancing himself from the beguiling fae isn't so easy.</p><p>Nearly killed by one of her own sisters, the last thing Isadora expects to hear is that a vampire saved her life while she was vulnerable—no being poses more of a lethal threat to the fae. Even more troubling is knowing she'll have to seek his help to have any hope of saving her fae sisters from the control of a powerful witch.</p><p>But though the ancient vampire should be feared, Isadora finds Mathias compelling, pricking her innate curiosity in a way she's never experienced. Ignoring such intrigue is impossible, and the more she learns, the more quickly her feelings turn into heavy attraction, tempting her to do the impossible—spend eternity with a vampire.</p>"
  },
  {
    "cover":"kiss-the-frog.jpg",
    "title":"Kiss The Frog",
    "author":"Alice Gaines",
    "series":"Princes of Danislova",
    "order":1,
    "tags":["contemporary","romance"],
    "pace":"fast-paced",
    "description":"<p>Pity sex with the shyest student in the lab?</p><p>That's what Felice Larson's friends have blackmailed her into. Dev VonRamsberg seems nice enough, if you can see past the hair that hangs in his face, the glasses, and the corduroy slacks. It'll be embarrassing for her and possibly humiliating for him, but if Felice doesn't follow through, the others will let their professor know she ditched on a critical research trip. So she borrows a key and lets herself into Dev's apartment in the middle of the night and promptly gets the surprise of her life.</p><p>Christian Devlin Philippe Pascal VonRamsberg, Crown Prince, and Heir Apparent to the Throne of Danislova, has lusted after his co-student, Felice Larson, for months but hasn't followed through because of his obligations back home. But now that she's literally snuck into his bed, he takes full advantage, much to their mutual delight. Dev's been hiding out in plain sight in the United States so he can get his graduate degree and enjoy a more or less normal life before he has to return to Danislova to fulfill his duties to his country. He never expected to fall for an American woman, but now that he has, how can he give her a happy ending?</p><p>Felice discovers that she's kissed a frog and won a prince, complete with a whirlwind tour of his lovely homeland in Eastern Europe. She falls in love with Danislova and the current Prince Royal, Dev's father—a man closer to a father figure for her than her own parents. Unfortunately, Dev's duties to his country require that he marry the right sort of woman…the wife his father has already selected for him. Will Felice and Dev face heartbreak, or can love triumph over tradition?</p>",
    "isbn":9781940854038,
    "publisher":"Smashwords",
    "date":"Jan 1, 2015",
    "words":68240
  },
  {
    "cover":"glass-slipper.jpg",
    "title":"The Glass Slipper",
    "author":"Alice Gaines",
    "series":"Princes of Danislova",
    "order":2,
    "tags":["contemporary","romance"],
    "pace":"fast-paced",
    "description":"<p>Casey Vaughn has an expensive model and even more expensive photographer cooling their heels in her boss's apartment, waiting for the male cover idol, who's late, late, late. When the guy finally does show up, he seems clueless about everything, including American slang, but he sure is cute. When the shoot proceeds to bore everyone to death, the woman Casey'd hired walks out, and Casey has to take her place. Now, sparks fly, and they share a heated kiss. Only after he's left does Casey discover he wasn't a model at all, and she grabbed a complete stranger off the street. Who is her mystery man, and how will she find him again?</p><p>Kurt VonRamsberg, Prince of Danislova and his country's ambassador to the United Nations, is walking to work one day, contemplating the end of an arranged engagement, when a young woman snatches him off the street and talks him into posing for the cover of a detective novel. Luckily, he got her phone number because his position in the Royal Family will not allow him to pose on the cover of such a book. He can't resist this fascinating woman, though, and pretends to be the descendant of German cheese maker in order to court her.</p><p>All is well until Casey's boss switches covers, and Kurt finds his image released on hundred of thousands of books in the United States and abroad. Summoned home to explain himself, Kurt reveals his true identity to Casey and asks her to accompany him.</p><p>Once in Danislova, Casey is entranced with the country and accepted by Kurt's family, with the notable exception of Kurt's father. Suddenly, she's transformed to Cinderella—the stepchild who can't please the stern Prince Royal no matter what she does. Will her own prince come to her rescue? Will the glass slipper ever fit?</p>"
  },
  {
    "cover":"beauty-awakened.jpg",
    "title":"Beauty Awakened",
    "author":"Alice Gaines",
    "series":"Princes of Danislova",
    "order":3,
    "tags":["contemporary","romance"],
    "pace":"fast-paced",
    "description":"<p>The clown prince.</p><p>Rick VonRamsberg is the family scamp—the Prince of Danislova from whom no one has ever expected much other than a smart remark and a decided talent with women. He's met his match in Dixie Ann Beaumont. For some reason, the fiery Southern belle is willing to share his bed but reluctant about emotional intimacy. What's up with that?</p><p>Dixie Ann Beaumont thinks the youngest prince of Danislova is as cute as a bug, but after a bad marriage, she's shy about being burned again—especially because her overly-critical family won't let her forget about her failure as a woman. Rick VonRamsberg is for fun only, as long as she can keep him at arm's length.</p><p>Luckily, the physical connection between Rick and Dixie proves stronger than her fear of attachment, and he finally seems to be winning her heart as well as her body. When Dixie's family shows up in Danislova, they're unable to break the couple up. Unfortunately, Rick's secret plans for their relationship may.</p>"
  },
  {
    "cover":"vampires-kiss.jpg",
    "title":"Vampire's Kiss",
    "author":"Ella Summers",
    "series":"Legion of Angels",
    "order":1,
    "tags":["fantasy","romance","adventurous","paranormal"],
    "pace":"fast-paced",
    "description":"<p><strong>Once you sip the Nectar of the gods, there's no going back.</strong></p><p>Leda Pierce is working as a paranormal bounty hunter on the Frontier, the dividing line between human civilization and the plains of monsters. Life is simple and the pay modest, but at least she has her family. That is, until a vampire hunt goes wrong and her brother goes missing, captured by the dark angels of hell.</p><p>With no magical powers of her own and no way to find him, Leda's only option is to go to New York and join the Legion of Angels, an elite unit of supernatural soldiers with powers gifted to them by the gods themselves. If she can survive long enough to make it up the ranks, she will gain the magic she needs to find her brother.</p><p>But Leda soon finds herself on the wrong side of a conspiracy that will shake up the supernatural world—and at the mercy of a fiercely powerful and tempting angel.</p>"
  },
  {
    "cover":"witchs-cauldron.jpg",
    "title":"Witch's Cauldron",
    "author":"Ella Summers",
    "series":"Legion of Angels",
    "order":2,
    "tags":["fantasy","romance","adventurous","paranormal"],
    "pace":"fast-paced",
    "description":"<p><strong>Something wicked is brewing in New York.</strong></p><p>“A month ago, I watched in horror as six of my fellow initiates died after sipping the Nectar of the gods, a heavenly drink that either grants you magical powers or kills you. I can't believe I'm coming back for seconds.”</p><p>Leda Pierce has survived the gods' first test and gained entry into the Legion of Angels, but the fight is far from over. Someone is poisoning the supernaturals of New York. Suspecting witches, the Legion sends in Leda to investigate. To save the city, she will need magic she doesn't have—and gaining that magic might just kill her. Now her survival depends on accepting help from the darkly seductive angel Nero, but that help comes with a price she cannot afford to pay.</p>"
  },
  {
    "cover":"sirens-song.jpg",
    "title":"Siren's Song",
    "author":"Ella Summers",
    "series":"Legion of Angels",
    "order":3,
    "tags":["fantasy","romance","adventurous","paranormal"],
    "pace":"fast-paced",
    "description":"<p><strong>When gods and demons clash, mortals bleed.</strong></p><p>Leda Pierce's latest mission brings her back to her hometown at the edge of the Frontier. But things have taken a turn for the worse in the six months since she left home to join the Legion of Angels in New York City. Crime lords now rule over the town, and the beasts' numbers are exploding just beyond the great magic wall that separates humanity from the plains of monsters.</p><p>Together with the fiercely seductive angel Nero, Leda guides a group of pilgrims across the monster-infested expanse to the ruins of the final battle between gods and demons. What begins as a pilgrimage, however, soon turns into a treasure hunt for an ancient weapon that could tip the balance of power between heaven and hell—and spirals into an intrigue that pits Leda and Nero against a rogue member of the Legion, a legendary angel as powerful as he is black-hearted.</p>"
  },
  {
    "cover":"dragons-storm.jpg",
    "title":"Dragon's Storm",
    "author":"Ella Summers",
    "series":"Legion of Angels",
    "order":4,
    "tags":["fantasy","romance","adventurous","paranormal"],
    "pace":"fast-paced",
    "description":"<p><strong>The supernatural storm of the century is coming.</strong></p><p>Leda's quest to gain the magic she needs to save her brother leads her to the castle of the Dragons, home of four soldiers in the Legion of Angels with extraordinary powers over the elements. If she makes it through their training, she might just survive her next sip of the gods' Nectar and level up her magic.</p><p>But the gods' gifts of magic come at a price. Leda can already feel the Nectar changing her, making her less human—and so is her budding romance with the angel Nero. Sip by sip, kiss by kiss, the change is taking hold of her.</p><p>As if that's not enough, Leda finds herself once again caught between the armies of heaven and hell—and tempted by a darkness that threatens to consume the Earth.</p>"
  },
  {
    "cover":"shifters-shadow.jpg",
    "title":"Shifter's Shadow",
    "author":"Ella Summers",
    "series":"Legion of Angels",
    "order":5,
    "tags":["fantasy","romance","adventurous","mysterious","emotional","paranormal"],
    "pace":"fast-paced",
    "description":"<p><strong>Next to the powers of heaven and hell, we are nothing.</strong></p><p>“So this was just one gigantic, cosmic war between light and dark magic. And we were only a small part of it, a tiny dot in the gods' empire. It was no wonder that they saw us as insignificant.”</p><p>Tested by the gods, Leda and her angelic mate Nero venture into the City of Ashes, a fallen fortress in the Western Wilderness where nightmarish monsters reign supreme and an ancient secret is buried. To survive the Gods' Trials, they will have to save the city—and they will have to do it without their magic.</p><p>Their victory, however, comes at a heavy price. And the secret they uncover will upset the balance of power between Earth and heaven.</p>"
  },
  {
    "cover":"psychics-spell.jpg",
    "title":"Psychic's Spell",
    "author":"Ella Summers",
    "series":"Legion of Angels",
    "order":6,
    "tags":["fantasy","romance","adventurous","paranormal"],
    "pace":"fast-paced",
    "description":"<p><strong>In the immortal war between gods and demons, one woman's past holds the key to humanity's future.</strong></p><p>One year after joining the Legion of Angels in New York City, Leda Pierce returns home to visit her family in Purgatory, a rough and rugged frontier town that borders the plains of monsters. Leda's family reunion is cut short, however, when her little sisters are captured by supernatural mercenaries.</p><p>Together with her angel lover Nero, she sets out to save them. Besieged by monsters, assailed by powerful foes, Leda knows this rescue mission won't be easy. What she doesn't expect is that it will bring her face-to-face with the secrets of her buried past.</p>"
  },
  {
    "cover":"fairys-touch.jpg",
    "title":"Fairy's Touch",
    "author":"Ella Summers",
    "series":"Legion of Angels",
    "order":7,
    "tags":["fantasy","romance","adventurous","paranormal"],
    "pace":"fast-paced",
    "description":"<p><strong>The games of gods play out upon the backbones of mortals.</strong></p><p>Leda Pierce has come a long way since she left her home on the frontier of civilization one year ago to join the Legion of Angels. She is a soldier in the gods' army, has crossed swords with demons, and shares an apartment with her angel lover in New York.</p><p>Every day brings Leda closer to becoming an angel herself—until a promotion ceremony goes horribly wrong, leaving her powers in magical limbo. Worse yet, the gods have taken over her training at Crystal Falls. Leda's failed magic and the gods' impossible challenges are the least of her worries, however. Someone is using the challenges to expose people's most-guarded secrets, and the skeletons in Leda's closet would mean her execution.</p>"
  },
  {
    "cover":"angels-flight.jpg",
    "title":"Angel's Flight",
    "author":"Ella Summers",
    "series":"Legion of Angels",
    "order":8,
    "tags":["fantasy","romance","adventurous","paranormal"],
    "pace":"fast-paced",
    "description":"<p><strong>The old saying is true. Knowledge really is power, especially when angels and gods play the game.</strong></p><p>The original Immortals, masters of magic, once reigned over every world in the known universe—until they suddenly vanished. The gods and demons have been fighting over the remains of their fractured empire ever since.</p><p>Millennia later, new angel Leda, a soldier in the gods' army, is recuperating from her transformation. Her recovery is cut short, however, when a curse strikes New York City, a spell targeted directly at the Legion of Angels. Even as the Legion's soldiers succumb to wrath, jealousy, and fear, the beasts on the plains of monsters are growing in numbers and power. And the longer Leda and her archangel lover Nero investigate these phenomena, the closer they come to the ancient secret that destroyed the Immortals—and that now threatens to tear the Earth apart.</p>"
  },
  {
    "cover":"ghosts-whisper.jpg",
    "title":"Ghost's Whisper",
    "author":"Ella Summers",
    "series":"Legion of Angels",
    "order":9,
    "tags":["fantasy","romance","adventurous","paranormal"],
    "description":"<p><strong>The enemy isn't a monster or a demon this time. It is fear, the destroyer of worlds.</strong></p><p>Life has never been better for Leda Pandora, the Angel of Chaos. She is married to the archangel Nero Windstriker, the love of her life. And she commands a vast territory, surrounded by her closest friends and family.</p><p>Everything is perfect—until the Earth's magic goes haywire. Now blood has become poison to vampires, witches are being killed by their own potions, and beasts can pass right through the magic barrier that separates civilization from the plains of monsters. And with each new incident, uncertainty and fear are growing stronger in both humans and supernaturals, driving them to violence.</p><p>If Leda can't find a way to stop these phenomena, it won't just be the end of all magic on Earth. It will be the end of humanity itself.</p>"
  },
  {
    "cover":"angel-fire.jpg",
    "title":"Angel Fire",
    "author":"Ella Summers",
    "series":"Immortal Legacy",
    "order":1,
    "tags":["fantasy","romance","paranormal"],
    "description":"<p>Cadence Lightbringer, daughter of an archangel, has trained from birth to one day drink the Nectar of the gods and ascend to the angels' ranks. She's always been the perfect soldier. She's always known exactly where her life is headed.</p><p>Until she is assigned to a mission with Damiel Dragonsire, Master Interrogator of the Legion of Angels.</p><p>Powerful, paranoid, and brutally intelligent, Damiel has built up a reputation for hunting down each and every traitor hiding within the Legion's ranks. And his latest suspect is Cadence. Convinced she is not the perfect soldier everyone believes her to be, he will stop at nothing to expose her.</p>"
  },
  {
    "cover":"angel-fury.jpg",
    "title":"Angel Fury",
    "author":"Ella Summers",
    "series":"Immortal Legacy",
    "order":2,
    "tags":["fantasy","romance","paranormal"],
    "description":"<p>Cadence Lightbringer, daughter of a legendary archangel, has always known her gods-endowed magic comes with a price. As an angel in the Legion of Angels, she lives where the Legion commands her to live, trains how the Legion tells her to train, and marries whom the Legion instructs her to marry.</p><p>Somehow it all sounded simpler in her head.</p><p>When Cadence is ordered to marry the enigmatic angel Damiel Dragonsire, a man she hardly knows, her whole perfect, predictable life is turned upside down. The wedding, however, is cut short by a dark threat that throws Cadence and Damiel into a world of magic as ancient and deadly as the original Immortals, powerful deities who once ruled the entire known universe.</p>"
  },
  {
    "cover":"angel-fever.jpg",
    "title":"Angel Fever",
    "author":"Ella Summers",
    "series":"Immortal Legacy",
    "order":3,
    "tags":["fantasy","romance","paranormal"],
    "description":"<p>Cadence Lightbringer has everything. The prestige and power that comes with being the Angel of Storm Castle. Her archangel husband and soulmate, Damiel Dragonsire, Master Interrogator in the Legion of Angels. And their son Nero, a miracle of magic, the first and only child of two angels.</p><p>But the Legion's mission to exterminate dark magic brings trouble to Cadence's door. What begins as a mission to apprehend a rogue angel escalates into a hunt for ancient relics that will turn her life upside down—and shake the very foundation of the Earth and every other world in the domains of heaven and hell.</p>"
  }
]