[
  {
    "cover":"kiss-the-frog.jpg",
    "title":"Kiss The Frog",
    "author":"Alice Gaines",
    "series":"Princes of Danislova",
    "order":1,
    "tags":["contemporary", "romance"],
    "pace":"fast-paced",
    "description":"<p>Pity sex with the shyest student in the lab?</p><p>That's what Felice Larson's friends have blackmailed her into. Dev VonRamsberg seems nice enough, if you can see past the hair that hangs in his face, the glasses, and the corduroy slacks. It'll be embarrassing for her and possibly humiliating for him, but if Felice doesn't follow through, the others will let their professor know she ditched on a critical research trip. So she borrows a key and lets herself into Dev's apartment in the middle of the night and promptly gets the surprise of her life.</p><p>Christian Devlin Philippe Pascal VonRamsberg, Crown Prince, and Heir Apparent to the Throne of Danislova, has lusted after his co-student, Felice Larson, for months but hasn't followed through because of his obligations back home. But now that she's literally snuck into his bed, he takes full advantage, much to their mutual delight. Dev's been hiding out in plain sight in the United States so he can get his graduate degree and enjoy a more or less normal life before he has to return to Danislova to fulfill his duties to his country. He never expected to fall for an American woman, but now that he has, how can he give her a happy ending?</p><p>Felice discovers that she's kissed a frog and won a prince, complete with a whirlwind tour of his lovely homeland in Eastern Europe. She falls in love with Danislova and the current Prince Royal, Dev's father—a man closer to a father figure for her than her own parents. Unfortunately, Dev's duties to his country require that he marry the right sort of woman…the wife his father has already selected for him. Will Felice and Dev face heartbreak, or can love triumph over tradition?</p>"
  },
  {
    "cover":"glass-slipper.jpg",
    "title":"The Glass Slipper",
    "author":"Alice Gaines",
    "series":"Princes of Danislova",
    "order":2,
    "tags":["contemporary", "romance"],
    "pace":"fast-paced",
    "description":"<p>Casey Vaughn has an expensive model and even more expensive photographer cooling their heels in her boss's apartment, waiting for the male cover idol, who's late, late, late. When the guy finally does show up, he seems clueless about everything, including American slang, but he sure is cute. When the shoot proceeds to bore everyone to death, the woman Casey'd hired walks out, and Casey has to take her place. Now, sparks fly, and they share a heated kiss. Only after he's left does Casey discover he wasn't a model at all, and she grabbed a complete stranger off the street. Who is her mystery man, and how will she find him again?</p><p>Kurt VonRamsberg, Prince of Danislova and his country's ambassador to the United Nations, is walking to work one day, contemplating the end of an arranged engagement, when a young woman snatches him off the street and talks him into posing for the cover of a detective novel. Luckily, he got her phone number because his position in the Royal Family will not allow him to pose on the cover of such a book. He can't resist this fascinating woman, though, and pretends to be the descendant of German cheese maker in order to court her.</p><p>All is well until Casey's boss switches covers, and Kurt finds his image released on hundred of thousands of books in the United States and abroad. Summoned home to explain himself, Kurt reveals his true identity to Casey and asks her to accompany him.</p><p>Once in Danislova, Casey is entranced with the country and accepted by Kurt's family, with the notable exception of Kurt's father. Suddenly, she's transformed to Cinderella—the stepchild who can't please the stern Prince Royal no matter what she does. Will her own prince come to her rescue? Will the glass slipper ever fit?</p>"
  },
  {
    "cover":"beauty-awakened.jpg",
    "title":"Beauty Awakened",
    "author":"Alice Gaines",
    "series":"Princes of Danislova",
    "order":3,
    "tags":["contemporary","romance"],
    "pace":"fast-paced",
    "description":"<p>The clown prince.</p><p>Rick VonRamsberg is the family scamp—the Prince of Danislova from whom no one has ever expected much other than a smart remark and a decided talent with women. He's met his match in Dixie Ann Beaumont. For some reason, the fiery Southern belle is willing to share his bed but reluctant about emotional intimacy. What's up with that?</p><p>Dixie Ann Beaumont thinks the youngest prince of Danislova is as cute as a bug, but after a bad marriage, she's shy about being burned again—especially because her overly-critical family won't let her forget about her failure as a woman. Rick VonRamsberg is for fun only, as long as she can keep him at arm's length.</p><p>Luckily, the physical connection between Rick and Dixie proves stronger than her fear of attachment, and he finally seems to be winning her heart as well as her body. When Dixie's family shows up in Danislova, they're unable to break the couple up. Unfortunately, Rick's secret plans for their relationship may.</p>"
  },
  {
    "cover":"vampires-kiss.jpg",
    "title":"Vampire's Kiss",
    "author":"Ella Summers",
    "series":"Legion of Angels",
    "order":1,
    "tags":["fantasy","romance","adventurous","paranormal"],
    "pace":"fast-paced",
    "description":"<p><strong>Once you sip the Nectar of the gods, there's no going back.</strong></p><p>Leda Pierce is working as a paranormal bounty hunter on the Frontier, the dividing line between human civilization and the plains of monsters. Life is simple and the pay modest, but at least she has her family. That is, until a vampire hunt goes wrong and her brother goes missing, captured by the dark angels of hell.</p><p>With no magical powers of her own and no way to find him, Leda's only option is to go to New York and join the Legion of Angels, an elite unit of supernatural soldiers with powers gifted to them by the gods themselves. If she can survive long enough to make it up the ranks, she will gain the magic she needs to find her brother.</p><p>But Leda soon finds herself on the wrong side of a conspiracy that will shake up the supernatural world—and at the mercy of a fiercely powerful and tempting angel.</p>"
  },
  {
    "cover":"witchs-cauldron.jpg",
    "title":"Witch's Cauldron",
    "author":"Ella Summers",
    "series":"Legion of Angels",
    "order":2,
    "tags":["fantasy","romance","adventurous","paranormal"],
    "pace":"fast-paced",
    "description":"<p><strong>Something wicked is brewing in New York.</strong></p><p>“A month ago, I watched in horror as six of my fellow initiates died after sipping the Nectar of the gods, a heavenly drink that either grants you magical powers or kills you. I can't believe I'm coming back for seconds.”</p><p>Leda Pierce has survived the gods' first test and gained entry into the Legion of Angels, but the fight is far from over. Someone is poisoning the supernaturals of New York. Suspecting witches, the Legion sends in Leda to investigate. To save the city, she will need magic she doesn't have—and gaining that magic might just kill her. Now her survival depends on accepting help from the darkly seductive angel Nero, but that help comes with a price she cannot afford to pay.</p>"
  },
  {
    "cover":"sirens-song.jpg",
    "title":"Siren's Song",
    "author":"Ella Summers",
    "series":"Legion of Angels",
    "order":3,
    "tags":["fantasy","romance","adventurous","paranormal"],
    "pace":"fast-paced",
    "description":"<p><strong>When gods and demons clash, mortals bleed.</strong></p><p>Leda Pierce's latest mission brings her back to her hometown at the edge of the Frontier. But things have taken a turn for the worse in the six months since she left home to join the Legion of Angels in New York City. Crime lords now rule over the town, and the beasts' numbers are exploding just beyond the great magic wall that separates humanity from the plains of monsters.</p><p>Together with the fiercely seductive angel Nero, Leda guides a group of pilgrims across the monster-infested expanse to the ruins of the final battle between gods and demons. What begins as a pilgrimage, however, soon turns into a treasure hunt for an ancient weapon that could tip the balance of power between heaven and hell—and spirals into an intrigue that pits Leda and Nero against a rogue member of the Legion, a legendary angel as powerful as he is black-hearted.</p>"
  },
  {
    "cover":"dragons-storm.jpg",
    "title":"Dragon's Storm",
    "author":"Ella Summers",
    "series":"Legion of Angels",
    "order":4,
    "tags":["fantasy","romance","adventurous","paranormal"],
    "pace":"fast-paced",
    "description":"<p><strong>The supernatural storm of the century is coming.</strong></p><p>Leda's quest to gain the magic she needs to save her brother leads her to the castle of the Dragons, home of four soldiers in the Legion of Angels with extraordinary powers over the elements. If she makes it through their training, she might just survive her next sip of the gods' Nectar and level up her magic.</p><p>But the gods' gifts of magic come at a price. Leda can already feel the Nectar changing her, making her less human—and so is her budding romance with the angel Nero. Sip by sip, kiss by kiss, the change is taking hold of her.</p><p>As if that's not enough, Leda finds herself once again caught between the armies of heaven and hell—and tempted by a darkness that threatens to consume the Earth.</p>"
  },
  {
    "cover":"shifters-shadow.jpg",
    "title":"Shifter's Shadow",
    "author":"Ella Summers",
    "series":"Legion of Angels",
    "order":5,
    "tags":["fantasy","romance","adventurous","mysterious","emotional","paranormal"],
    "pace":"fast-paced",
    "description":"<p><strong>Next to the powers of heaven and hell, we are nothing.</strong></p><p>“So this was just one gigantic, cosmic war between light and dark magic. And we were only a small part of it, a tiny dot in the gods' empire. It was no wonder that they saw us as insignificant.”</p><p>Tested by the gods, Leda and her angelic mate Nero venture into the City of Ashes, a fallen fortress in the Western Wilderness where nightmarish monsters reign supreme and an ancient secret is buried. To survive the Gods' Trials, they will have to save the city—and they will have to do it without their magic.</p><p>Their victory, however, comes at a heavy price. And the secret they uncover will upset the balance of power between Earth and heaven.</p>"
  },
  {
    "cover":"psychics-spell.jpg",
    "title":"Psychic's Spell",
    "author":"Ella Summers",
    "series":"Legion of Angels",
    "order":6,
    "tags":["fantasy","romance","adventurous","paranormal"],
    "pace":"fast-paced",
    "description":"<p><strong>In the immortal war between gods and demons, one woman's past holds the key to humanity's future.</strong></p><p>One year after joining the Legion of Angels in New York City, Leda Pierce returns home to visit her family in Purgatory, a rough and rugged frontier town that borders the plains of monsters. Leda's family reunion is cut short, however, when her little sisters are captured by supernatural mercenaries.</p><p>Together with her angel lover Nero, she sets out to save them. Besieged by monsters, assailed by powerful foes, Leda knows this rescue mission won't be easy. What she doesn't expect is that it will bring her face-to-face with the secrets of her buried past.</p>"
  },
  {
    "cover":"fairys-touch.jpg",
    "title":"Fairy's Touch",
    "author":"Ella Summers",
    "series":"Legion of Angels",
    "order":7,
    "tags":["fantasy","romance","adventurous","paranormal"],
    "pace":"fast-paced",
    "description":"<p><strong>The games of gods play out upon the backbones of mortals.</strong></p><p>Leda Pierce has come a long way since she left her home on the frontier of civilization one year ago to join the Legion of Angels. She is a soldier in the gods' army, has crossed swords with demons, and shares an apartment with her angel lover in New York.</p><p>Every day brings Leda closer to becoming an angel herself—until a promotion ceremony goes horribly wrong, leaving her powers in magical limbo. Worse yet, the gods have taken over her training at Crystal Falls. Leda's failed magic and the gods' impossible challenges are the least of her worries, however. Someone is using the challenges to expose people's most-guarded secrets, and the skeletons in Leda's closet would mean her execution.</p>"
  },
  {
    "cover":"angels-flight.jpg",
    "title":"Angel's Flight",
    "author":"Ella Summers",
    "series":"Legion of Angels",
    "order":8,
    "tags":["fantasy","romance","adventurous","paranormal"],
    "pace":"fast-paced",
    "description":"<p><strong>The old saying is true. Knowledge really is power, especially when angels and gods play the game.</strong></p><p>The original Immortals, masters of magic, once reigned over every world in the known universe—until they suddenly vanished. The gods and demons have been fighting over the remains of their fractured empire ever since.</p><p>Millennia later, new angel Leda, a soldier in the gods' army, is recuperating from her transformation. Her recovery is cut short, however, when a curse strikes New York City, a spell targeted directly at the Legion of Angels. Even as the Legion's soldiers succumb to wrath, jealousy, and fear, the beasts on the plains of monsters are growing in numbers and power. And the longer Leda and her archangel lover Nero investigate these phenomena, the closer they come to the ancient secret that destroyed the Immortals—and that now threatens to tear the Earth apart.</p>"
  },
  {
    "cover":"ghosts-whisper.jpg",
    "title":"Ghost's Whisper",
    "author":"Ella Summers",
    "series":"Legion of Angels",
    "order":9,
    "tags":["fantasy","romance","adventurous","paranormal"],
    "description":"<p><strong>The enemy isn't a monster or a demon this time. It is fear, the destroyer of worlds.</strong></p><p>Life has never been better for Leda Pandora, the Angel of Chaos. She is married to the archangel Nero Windstriker, the love of her life. And she commands a vast territory, surrounded by her closest friends and family.</p><p>Everything is perfect—until the Earth's magic goes haywire. Now blood has become poison to vampires, witches are being killed by their own potions, and beasts can pass right through the magic barrier that separates civilization from the plains of monsters. And with each new incident, uncertainty and fear are growing stronger in both humans and supernaturals, driving them to violence.</p><p>If Leda can't find a way to stop these phenomena, it won't just be the end of all magic on Earth. It will be the end of humanity itself.</p>"
  },
  {
    "cover":"angel-fire.jpg",
    "title":"Angel Fire",
    "author":"Ella Summers",
    "series":"Immortal Legacy",
    "order":1,
    "tags":["fantasy","romance","paranormal"],
    "description":"<p>Cadence Lightbringer, daughter of an archangel, has trained from birth to one day drink the Nectar of the gods and ascend to the angels' ranks. She's always been the perfect soldier. She's always known exactly where her life is headed.</p><p>Until she is assigned to a mission with Damiel Dragonsire, Master Interrogator of the Legion of Angels.</p><p>Powerful, paranoid, and brutally intelligent, Damiel has built up a reputation for hunting down each and every traitor hiding within the Legion's ranks. And his latest suspect is Cadence. Convinced she is not the perfect soldier everyone believes her to be, he will stop at nothing to expose her.</p>"
  },
  {
    "cover":"angel-fury.jpg",
    "title":"Angel Fury",
    "author":"Ella Summers",
    "series":"Immortal Legacy",
    "order":2,
    "tags":["fantasy","romance","paranormal"],
    "description":"<p>Cadence Lightbringer, daughter of a legendary archangel, has always known her gods-endowed magic comes with a price. As an angel in the Legion of Angels, she lives where the Legion commands her to live, trains how the Legion tells her to train, and marries whom the Legion instructs her to marry.</p><p>Somehow it all sounded simpler in her head.</p><p>When Cadence is ordered to marry the enigmatic angel Damiel Dragonsire, a man she hardly knows, her whole perfect, predictable life is turned upside down. The wedding, however, is cut short by a dark threat that throws Cadence and Damiel into a world of magic as ancient and deadly as the original Immortals, powerful deities who once ruled the entire known universe.</p>"
  },
  {
    "cover":"angel-fever.jpg",
    "title":"Angel Fever",
    "author":"Ella Summers",
    "series":"Immortal Legacy",
    "order":3,
    "tags":["fantasy","romance","paranormal"],
    "description":"<p>Cadence Lightbringer has everything. The prestige and power that comes with being the Angel of Storm Castle. Her archangel husband and soulmate, Damiel Dragonsire, Master Interrogator in the Legion of Angels. And their son Nero, a miracle of magic, the first and only child of two angels.</p><p>But the Legion's mission to exterminate dark magic brings trouble to Cadence's door. What begins as a mission to apprehend a rogue angel escalates into a hunt for ancient relics that will turn her life upside down—and shake the very foundation of the Earth and every other world in the domains of heaven and hell.</p>"
  }
]