[
  {
    "genre":["Young Adult", "New Adult"],
    "cover":"assassins-blade.jpg",
    "title":"Assassin's Blade",
    "author":"Sarah J. Maas",
    "series":"Throne of Glass",
    "order":0.5,
    "tags":["fantasy","romance","adventurous"],
    "pace":"fast-paced",
    "description":"<p>Celaena Sardothien is Adarlan's most feared assassin. As part of the Assassin's Guild, she's sworn to her master, Arobynn Hamel, yet Celaena listens to no one and trusts only her fellow killer for hire, Sam.</p><p>In these action-packed prequel novellas to Throne of Glass, Celaena embarks on five daring missions. They take her from remote islands to hostile deserts, where she fights to liberate slaves and avenge tyranny. But by acting on her own terms, will Celaena truly free herself from her master, or will she suffer an unimaginable punishment for such treachery?</p>"
  },
  {
    "genre":["Young Adult", "New Adult"],
    "cover":"throne-of-glass.jpg",
    "title":"Throne of Glass",
    "author":"Sarah J. Maas",
    "series":"Throne of Glass",
    "order":1,
    "tags":["fantasy","romance","adventurous"],
    "pace":"fast-paced",
    "description":"<p><strong>Meet Celaena Sardothien.</strong></p><p><strong>Beautiful. Deadly. Destined for greatness.</strong></p><p>In a land without magic, where the king rules with an iron hand, Celaena, an assassin, is summoned to the castle. She comes not to kill the king, but to win her freedom. If she defeats twenty-three killers, thieves, and warriors in a competition, she is released from prison to serve as the king's champion.</p><p>The Crown Prince will provoke her. The Captain of the Guard will protect her. But something evil dwells in the castle of glass—and it's there to kill. When her competitors start dying one by one, Celaena's fight for freedom becomes a fight for survival, and a desperate quest to root out the evil before it destroys her world.</p>"
  },
  {
    "genre":["Young Adult", "New Adult"],
    "cover":"crown-of-midnight.jpg",
    "title":"Crown of Midnight",
    "author":"Sarah J. Maas",
    "series":"Throne of Glass",
    "order":2,
    "tags":["fantasy","romance","adventurous"],
    "pace":"fast-paced",
    "description":"<p><strong>'A line that should never be crossed is about to be breached. It puts this entire castle in jeopardy—and the life of your friend.'</strong></p><p>From the throne of glass rules a king with a fist of iron and a soul as black as pitch. Bold, daring, and lethal, assassin Celaena Sardothien won the brutal contest to become his Champion. Yet Celaena is far from loyal to the crown. She hides her secret vigilantly; she knows that the man she serves is bent on evil.</p><p>Keeping up the deadly charade becomes increasingly difficult when Celaena realizes she is not the only one seeking justice. As she tries to untangle the mysteries buried deep within the glass castle, her closest relationships suffer. It seems no one is above questioning her allegiances—not the Crown Prince Dorian; not Chaol, the Captain of the Guard; not even her best friend, Nehemia, a foreign princess with a rebel heart.</p><p>Then, an unspeakable tragedy shatters Celaena's world. She must decide once and for all where her loyalties lie . . . and whom she will fight for.</p>"
  },
  {
    "genre":["Young Adult", "New Adult"],
    "cover":"heir-of-fire.jpg",
    "title":"Heir of Fire",
    "author":"Sarah J. Maas",
    "series":"Throne of Glass",
    "order":3,
    "tags":["fantasy","romance","adventurous"],
    "pace":"fast-paced",
    "description":"<p><strong>Queen or traitor? Only she can decide.</strong></p><p>Celaena Sardothien has survived deadly contests and shattering heartbreak—but at an unspeakable cost. Lost and broken, Celaena's only thought is to avenge the savage death of her dearest friend. But she must instead travel to a new land to confront her darkest truth... a truth about her heritage that could change her life—and her future—forever.</p><p>Meanwhile, brutal and monstrous forces are gathering on the horizon, intent on enslaving her world. To defeat them, Celaena must find the strength to not only fight her inner demons but to battle the evil that is about to be unleashed. If she can overcome them, she will be Adarlan's biggest threat—and his own deadliest enemy.</p><p>The king's assassin takes on an even greater destiny and burns brighter than ever before in this follow-up to the <em>New York Times</em> bestselling <em>Crown of Midnight.</em></p>"
  },
  {
    "genre":["Young Adult", "New Adult"],
    "cover":"queen-of-shadows.jpg",
    "title":"Queen of Shadows",
    "author":"Sarah J. Maas",
    "series":"Throne of Glass",
    "order":4,
    "tags":["fantasy","romance","adventurous"],
    "pace":"fast-paced",
    "description":"<p><strong>Her destiny awaits. But first, vengeance...</strong></p><p>Everyone Celaena Sardothien loves has been taken from her. But she's at last returned to the empire—for vengeance, to rescue her once-glorious kingdom, and to confront the shadows of her past…</p><p>She will fight for her cousin, a warrior prepared to die for her to regain her throne. She will fight for her friend, a young man trapped in an unspeakable prison. And she will fight for her people, enslaved to a brutal king and awaiting their lost queen's triumphant return.</p><p>Celaena's epic journey has captured the hearts and imaginations of millions across the globe. This fourth volume will hold readers rapt as Celaena's story builds to a passionate, agonizing crescendo that might just shatter her world.</p>"
  },
  {
    "genre":["Young Adult", "New Adult"],
    "cover":"empire-of-storms.png",
    "title":"Empire of Storms",
    "author":"Sarah J. Maas",
    "series":"Throne of Glass",
    "order":5,
    "tags":["fantasy","romance","adventurous"],
    "pace":"fast-paced",
    "description":"<p>The long path to the throne has only just begun for Aelin Galathynius. Loyalties have been broken and bought, friends have been lost and gained, and those who possess magic find themselves at odds with those who don't.</p><p>As the kingdoms of Erilea fracture around her, enemies must become allies if Aelin is to keep those she loves from falling to the dark forces poised to claim her world. With war looming on all horizons, the only chance for salvation lies in a desperate quest that may mark the end of everything Aelin holds dear.</p><p>Aelin's journey from assassin to queen has entranced millions across the globe, and this fifth installment will leave fans breathless. Will Aelin succeed in keeping her world from splintering, or will it all come crashing down?</p>"
  },
  {
    "genre":["Young Adult", "New Adult"],
    "cover":"tower-of-dawn.jpg",
    "title":"Tower of Dawn",
    "author":"Sarah J. Maas",
    "series":"Throne of Glass",
    "order":6,
    "tags":["fantasy","romance","adventurous"],
    "pace":"medium-paced",
    "description":"<p>Chaol Westfall has always defined himself by his unwavering loyalty, his strength, and his position as the Captain of the Guard. But all of that has changed since the glass castle shattered, since his men were slaughtered, since the King of Adarlan spared him from a killing blow, but left his body broken.</p><p>His only shot at recovery lies with the legendary healers of the Torre Cesme in Antica—the stronghold of the southern continent's mighty empire. And with war looming over Dorian and Aelin back home, their survival might lie with Chaol and Nesryn convincing its rulers to ally with them.</p><p>But what they discover in Antica will change them both—and be more vital to saving Erilea than they could have imagined.</p>"
  },
  {
    "genre":["Young Adult", "New Adult"],
    "cover":"kingdom-of-ash.jpg",
    "title":"Kingdom of Ash",
    "author":"Sarah J. Maas",
    "series":"Throne of Glass",
    "order":7,
    "tags":["fantasy","romance","adventurous"],
    "pace":"fast-paced",
    "description":"<p><strong>Years in the making, Sarah J. Maas's #1 <em>New York Times</em> bestselling <em>Throne of Glass</em> series draws to an epic, unforgettable conclusion. Aelin Galathynius's journey from slave to king's assassin to the queen of a once-great kingdom reaches its heart-rending finale as war erupts across her world. . .<strong></p><p>Aelin has risked everything to save her people-but at a tremendous cost. Locked within an iron coffin by the Queen of the Fae, Aelin must draw upon her fiery will as she endures months of torture. Aware that yielding to Maeve will doom those she loves keeps her from breaking, though her resolve begins to unravel with each passing day…</p><p>With Aelin captured, Aedion and Lysandra remain the last line of defense to protect Terrasen from utter destruction. Yet they soon realize that the many allies they've gathered to battle Erawan's hordes might not be enough to save them. Scattered across the continent and racing against time, Chaol, Manon, and Dorian are forced to forge their own paths to meet their fates. Hanging in the balance is any hope of salvation-and a better world.</p><p>And across the sea, his companions unwavering beside him, Rowan hunts to find his captured wife and queen-before she is lost to him forever.</p><p>As the threads of fate weave together at last, all must fight, if they are to have a chance at a future. Some bonds will grow even deeper, while others will be severed forever in the explosive final chapter of the <em>Throne of Glass</em> series.</p>"
  },
  {
    "genre":["Young Adult", "New Adult"],
    "cover":"a-court-of-thorns-and-roses.jpg",
    "title":"A Court of Thorns and Roses",
    "author":"Sarah J. Maas",
    "series":"A Court of Thorns and Roses",
    "order":1,
    "tags":["fantasy","romance","adventurous"],
    "pace":"medium-paced",
    "isbn":"978-1-61963-445-9",
    "description":"<p>When nineteen-year-old huntress Feyre kills a wolf in the woods, a beast-like creature arrives to demand retribution for it. Dragged to a treacherous magical land she only knows about from legends, Feyre discovers that her captor is not an animal, but Tamlin—one of the lethal, immortal faeries who once ruled their world.</p><p>As she dwells on his estate, her feelings for Tamlin transform from icy hostility into a fiery passion that burns through every lie and warning she's been told about the beautiful, dangerous world of the Fae. But an ancient, wicked shadow over the faerie lands is growing, and Feyre must find a way to stop it…or doom Tamlin—and his world—forever.</p><p>Perfect for fans of Kristin Cashore and George R. R. Martin, this first book in a sexy and action-packed new series is impossible to put down!</p>"
  },
  {
    "genre":["Young Adult", "New Adult"],
    "cover":"a-court-of-mist-and-fury.jpg",
    "title":"A Court of Mist and Fury",
    "author":"Sarah J. Maas",
    "series":"A Court of Thorns and Roses",
    "order":2,
    "tags":["fantasy","romance","adventurous"],
    "pace":"medium-paced",
    "isbn":"978-1-4088-5788-5",
    "description":"<p>Feyre survived Amarantha's clutches to return to the Spring Court—but at a steep cost. Though she now has the powers of the High Fae, her heart remains human, and it can't forget the terrible deeds she performed to save Tamlin's people.</p><p>Nor has Feyre forgotten her bargain with Rhysand, High Lord of the feared Night Court. As Feyre navigates its dark web of politics, passion, and dazzling power, a greater evil looms—and she might be key to stopping it. But only if she can harness her harrowing gifts, heal her fractured soul, and decide how she wishes to shape her future—and the future of a world cleaved in two.</p><p>With more than a million copies sold of her beloved <em>Throne of Glass</em> series, Sarah J. Maas's masterful storytelling brings this second book in her seductive and action-packed series to new heights.</p>"
  },
  {
    "genre":["Young Adult", "New Adult"],
    "cover":"a-court-of-wings-and-ruin.jpg",
    "title":"A Court of Wings and Ruin",
    "author":"Sarah J. Maas",
    "series":"A Court of Thorns and Roses",
    "order":3,
    "tags":["fantasy","romance","adventurous"],
    "pace":"medium-paced",
    "isbn":"978-1-61963-449-7",
    "description":"<p>Feyre has returned to the Spring Court, determined to gather information on Tamlin's maneuverings and the invading king threatening to bring Prythian to its knees. But to do so she must play a deadly game of deceit-and one slip may spell doom not only for Feyre, but for her world as well.</p><p>As war bears down upon them all, Feyre must decide who to trust amongst the dazzling and lethal High Lords-and hunt for allies in unexpected places.</p><p>In this thrilling third book in the #1 <em>New York Times</em> bestselling series from Sarah J. Maas, the earth will be painted red as mighty armies grapple for power over the one thing that could destroy them all.</p>"
  },
  {
    "genre":["Young Adult", "New Adult"],
    "cover":"a-court-of-frost-and-starlight.jpg",
    "title":"A Court of Frost and Starlight",
    "author":"Sarah J. Maas",
    "series":"A Court of Thorns and Roses",
    "order":3.1,
    "tags":["fantasy","romance","adventurous"],
    "pace":"medium-paced",
    "isbn":"978-1-4088-9031-8",
    "description":"<p>Narrated by Feyre and Rhysand, this story bridges the events in <em>A Court of Wings and Ruin</em> and the upcoming novels in the series.</p><p>Feyre, Rhys and their companions are still busy rebuilding the Night Court and the vastly changed world beyond. But Winter Solstice is finally near, and with it a hard-earned reprieve. Yet even the festive atmosphere can't keep the shadows of the past from looming. As Feyre navigates her first Winter Solstice as High Lady, she finds that those dearest to her have more wounds than she anticipated—scars that will have a far-reaching impact on the future of their court.</p>"
  }
]